{"keras_version": "2.2.4", "class_name": "Sequential", "config": {"layers": [{"class_name": "Conv1D", "config": {"dilation_rate": [1], "bias_constraint": null, "kernel_size": [3], "batch_input_shape": [null, 28, 1], "name": "conv1d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "use_bias": true, "activation": "tanh", "strides": [1], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "dtype": "float32", "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "filters": 64}}, {"class_name": "Conv1D", "config": {"dilation_rate": [1], "bias_constraint": null, "kernel_size": [3], "name": "conv1d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "use_bias": true, "activation": "tanh", "strides": [1], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "filters": 64}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "name": "max_pooling1d_1", "padding": "valid", "pool_size": [3], "data_format": "channels_last", "strides": [3]}}, {"class_name": "Conv1D", "config": {"dilation_rate": [1], "bias_constraint": null, "kernel_size": [3], "name": "conv1d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "use_bias": true, "activation": "tanh", "strides": [1], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "filters": 128}}, {"class_name": "Conv1D", "config": {"dilation_rate": [1], "bias_constraint": null, "kernel_size": [3], "name": "conv1d_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "use_bias": true, "activation": "tanh", "strides": [1], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "filters": 128}}, {"class_name": "GlobalAveragePooling1D", "config": {"trainable": true, "data_format": "channels_last", "name": "global_average_pooling1d_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "rate": 0.5, "name": "dropout_1", "noise_shape": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "name": "dense_1", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "use_bias": true, "activation": "sigmoid", "bias_regularizer": null, "kernel_constraint": null, "units": 1, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}], "name": "sequential_1"}, "backend": "tensorflow"}