{"backend": "tensorflow", "class_name": "Sequential", "config": {"layers": [{"class_name": "Conv1D", "config": {"trainable": true, "name": "conv1d_1", "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1], "filters": 64, "activity_regularizer": null, "kernel_size": [3], "batch_input_shape": [null, 28, 1], "activation": "relu", "dtype": "float32", "strides": [1], "data_format": "channels_last"}}, {"class_name": "Conv1D", "config": {"trainable": true, "name": "conv1d_2", "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1], "filters": 64, "activity_regularizer": null, "kernel_size": [3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "data_format": "channels_last", "strides": [1]}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "name": "max_pooling1d_1", "pool_size": [3], "data_format": "channels_last", "padding": "valid", "strides": [3]}}, {"class_name": "Conv1D", "config": {"trainable": true, "name": "conv1d_3", "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1], "filters": 128, "activity_regularizer": null, "kernel_size": [3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "data_format": "channels_last", "strides": [1]}}, {"class_name": "Conv1D", "config": {"trainable": true, "name": "conv1d_4", "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1], "filters": 128, "activity_regularizer": null, "kernel_size": [3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "data_format": "channels_last", "strides": [1]}}, {"class_name": "GlobalAveragePooling1D", "config": {"trainable": true, "data_format": "channels_last", "name": "global_average_pooling1d_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "noise_shape": null, "rate": 0.5, "seed": null}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_1", "bias_constraint": null, "units": 1, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "sigmoid", "use_bias": true}}], "name": "sequential_1"}, "keras_version": "2.2.4"}