{"config": {"name": "sequential_1", "layers": [{"config": {"use_bias": true, "kernel_constraint": null, "activation": "sigmoid", "trainable": true, "name": "conv1d_1", "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "bias_regularizer": null, "batch_input_shape": [null, 28, 1], "activity_regularizer": null, "bias_constraint": null, "kernel_size": [3], "dilation_rate": [1], "data_format": "channels_last", "kernel_regularizer": null, "filters": 64, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1]}, "class_name": "Conv1D"}, {"config": {"use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "name": "conv1d_2", "bias_constraint": null, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [3], "dilation_rate": [1], "data_format": "channels_last", "kernel_regularizer": null, "filters": 64, "activation": "sigmoid", "strides": [1]}, "class_name": "Conv1D"}, {"config": {"pool_size": [3], "trainable": true, "data_format": "channels_last", "name": "max_pooling1d_1", "strides": [3], "padding": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "name": "conv1d_3", "bias_constraint": null, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [3], "dilation_rate": [1], "data_format": "channels_last", "kernel_regularizer": null, "filters": 128, "activation": "sigmoid", "strides": [1]}, "class_name": "Conv1D"}, {"config": {"use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "name": "conv1d_4", "bias_constraint": null, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [3], "dilation_rate": [1], "data_format": "channels_last", "kernel_regularizer": null, "filters": 128, "activation": "sigmoid", "strides": [1]}, "class_name": "Conv1D"}, {"config": {"name": "global_average_pooling1d_1", "trainable": true, "data_format": "channels_last"}, "class_name": "GlobalAveragePooling1D"}, {"config": {"seed": null, "name": "dropout_1", "noise_shape": null, "rate": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"use_bias": true, "kernel_constraint": null, "units": 1, "trainable": true, "name": "dense_1", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "sigmoid"}, "class_name": "Dense"}]}, "keras_version": "2.2.4", "class_name": "Sequential", "backend": "tensorflow"}