{"class_name": "Sequential", "keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv1D", "config": {"filters": 64, "name": "conv1d_1", "padding": "valid", "strides": [1], "batch_input_shape": [null, 28, 1], "dilation_rate": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_size": [3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "data_format": "channels_last", "use_bias": true}}, {"class_name": "Conv1D", "config": {"bias_regularizer": null, "bias_constraint": null, "padding": "valid", "filters": 64, "dilation_rate": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "strides": [1], "activity_regularizer": null, "activation": "relu", "trainable": true, "kernel_constraint": null, "kernel_size": [3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_2", "data_format": "channels_last", "use_bias": true}}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "pool_size": [3], "name": "max_pooling1d_1", "data_format": "channels_last", "trainable": true, "strides": [3]}}, {"class_name": "Conv1D", "config": {"bias_regularizer": null, "bias_constraint": null, "padding": "valid", "filters": 128, "dilation_rate": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "strides": [1], "activity_regularizer": null, "activation": "relu", "trainable": true, "kernel_constraint": null, "kernel_size": [3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_3", "data_format": "channels_last", "use_bias": true}}, {"class_name": "Conv1D", "config": {"bias_regularizer": null, "bias_constraint": null, "padding": "valid", "filters": 128, "dilation_rate": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "strides": [1], "activity_regularizer": null, "activation": "relu", "trainable": true, "kernel_constraint": null, "kernel_size": [3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_4", "data_format": "channels_last", "use_bias": true}}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_1", "rate": 0.5, "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_1", "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}]}, "backend": "tensorflow"}