{"backend": "tensorflow", "class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "LSTM", "config": {"kernel_regularizer": null, "trainable": true, "dropout": 0.0, "recurrent_regularizer": null, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "recurrent_dropout": 0.0, "unroll": false, "kernel_constraint": null, "stateful": false, "units": 128, "activity_regularizer": null, "implementation": 1, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "unit_forget_bias": true, "bias_constraint": null, "name": "lstm_1", "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "batch_input_shape": [null, 24, 1], "return_state": false, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "seed": null, "trainable": true, "rate": 0.2, "noise_shape": null}}, {"class_name": "LSTM", "config": {"kernel_regularizer": null, "trainable": true, "dropout": 0.0, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "recurrent_dropout": 0.0, "go_backwards": false, "kernel_constraint": null, "unroll": false, "stateful": false, "units": 50, "activity_regularizer": null, "implementation": 1, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "unit_forget_bias": true, "bias_constraint": null, "name": "lstm_2", "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "return_state": false, "return_sequences": true, "use_bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "seed": null, "trainable": true, "rate": 0.2, "noise_shape": null}}, {"class_name": "LSTM", "config": {"kernel_regularizer": null, "trainable": true, "dropout": 0.0, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "recurrent_dropout": 0.0, "go_backwards": false, "kernel_constraint": null, "unroll": false, "stateful": false, "units": 50, "activity_regularizer": null, "implementation": 1, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "unit_forget_bias": true, "bias_constraint": null, "name": "lstm_3", "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "return_state": false, "return_sequences": true, "use_bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "seed": null, "trainable": true, "rate": 0.2, "noise_shape": null}}, {"class_name": "LSTM", "config": {"kernel_regularizer": null, "trainable": true, "dropout": 0.0, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "recurrent_dropout": 0.0, "go_backwards": false, "kernel_constraint": null, "unroll": false, "stateful": false, "units": 50, "activity_regularizer": null, "implementation": 1, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "unit_forget_bias": true, "bias_constraint": null, "name": "lstm_4", "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "return_state": false, "return_sequences": false, "use_bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "seed": null, "trainable": true, "rate": 0.2, "noise_shape": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_regularizer": null, "activation": "linear", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "name": "dense_1", "bias_regularizer": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true}}]}, "keras_version": "2.2.4"}