{"class_name": "Sequential", "keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"class_name": "LSTM", "config": {"dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activation": "softmax", "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "batch_input_shape": [null, 24, 1], "recurrent_dropout": 0.0, "dropout": 0.0, "kernel_constraint": null, "kernel_regularizer": null, "recurrent_constraint": null, "return_state": false, "return_sequences": true, "use_bias": true, "name": "lstm_1", "units": 128, "trainable": true, "stateful": false, "activity_regularizer": null, "go_backwards": false, "implementation": 1, "bias_regularizer": null, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "recurrent_regularizer": null, "unit_forget_bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "seed": null, "trainable": true, "rate": 0.2, "noise_shape": null}}, {"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activation": "softmax", "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "recurrent_dropout": 0.0, "dropout": 0.0, "kernel_constraint": null, "kernel_regularizer": null, "recurrent_constraint": null, "return_state": false, "return_sequences": true, "use_bias": true, "name": "lstm_2", "units": 50, "trainable": true, "stateful": false, "activity_regularizer": null, "go_backwards": false, "implementation": 1, "bias_regularizer": null, "unroll": false, "bias_constraint": null, "recurrent_regularizer": null, "unit_forget_bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "seed": null, "trainable": true, "rate": 0.2, "noise_shape": null}}, {"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activation": "softmax", "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "recurrent_dropout": 0.0, "dropout": 0.0, "kernel_constraint": null, "kernel_regularizer": null, "recurrent_constraint": null, "return_state": false, "return_sequences": true, "use_bias": true, "name": "lstm_3", "units": 50, "trainable": true, "stateful": false, "activity_regularizer": null, "go_backwards": false, "implementation": 1, "bias_regularizer": null, "unroll": false, "bias_constraint": null, "recurrent_regularizer": null, "unit_forget_bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "seed": null, "trainable": true, "rate": 0.2, "noise_shape": null}}, {"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activation": "softmax", "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "recurrent_dropout": 0.0, "dropout": 0.0, "kernel_constraint": null, "kernel_regularizer": null, "recurrent_constraint": null, "return_state": false, "return_sequences": true, "use_bias": true, "name": "lstm_4", "units": 50, "trainable": true, "stateful": false, "activity_regularizer": null, "go_backwards": false, "implementation": 1, "bias_regularizer": null, "unroll": false, "bias_constraint": null, "recurrent_regularizer": null, "unit_forget_bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "seed": null, "trainable": true, "rate": 0.2, "noise_shape": null}}, {"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activation": "softmax", "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "recurrent_dropout": 0.0, "dropout": 0.0, "kernel_constraint": null, "kernel_regularizer": null, "recurrent_constraint": null, "return_state": false, "return_sequences": true, "use_bias": true, "name": "lstm_5", "units": 50, "trainable": true, "stateful": false, "activity_regularizer": null, "go_backwards": false, "implementation": 1, "bias_regularizer": null, "unroll": false, "bias_constraint": null, "recurrent_regularizer": null, "unit_forget_bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "seed": null, "trainable": true, "rate": 0.2, "noise_shape": null}}, {"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activation": "softmax", "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "recurrent_dropout": 0.0, "dropout": 0.0, "kernel_constraint": null, "kernel_regularizer": null, "recurrent_constraint": null, "return_state": false, "return_sequences": true, "use_bias": true, "name": "lstm_6", "units": 50, "trainable": true, "stateful": false, "activity_regularizer": null, "go_backwards": false, "implementation": 1, "bias_regularizer": null, "unroll": false, "bias_constraint": null, "recurrent_regularizer": null, "unit_forget_bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "seed": null, "trainable": true, "rate": 0.2, "noise_shape": null}}, {"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activation": "softmax", "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "recurrent_dropout": 0.0, "dropout": 0.0, "kernel_constraint": null, "kernel_regularizer": null, "recurrent_constraint": null, "return_state": false, "return_sequences": true, "use_bias": true, "name": "lstm_7", "units": 50, "trainable": true, "stateful": false, "activity_regularizer": null, "go_backwards": false, "implementation": 1, "bias_regularizer": null, "unroll": false, "bias_constraint": null, "recurrent_regularizer": null, "unit_forget_bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_7", "seed": null, "trainable": true, "rate": 0.2, "noise_shape": null}}, {"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activation": "softmax", "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "recurrent_dropout": 0.0, "dropout": 0.0, "kernel_constraint": null, "kernel_regularizer": null, "recurrent_constraint": null, "return_state": false, "return_sequences": false, "use_bias": true, "name": "lstm_8", "units": 50, "trainable": true, "stateful": false, "activity_regularizer": null, "go_backwards": false, "implementation": 1, "bias_regularizer": null, "unroll": false, "bias_constraint": null, "recurrent_regularizer": null, "unit_forget_bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_8", "seed": null, "trainable": true, "rate": 0.2, "noise_shape": null}}, {"class_name": "Dense", "config": {"use_bias": true, "name": "dense_1", "units": 1, "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear"}}]}, "backend": "tensorflow"}