{"keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Sequential", "config": {"layers": [{"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "stateful": false, "trainable": true, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "implementation": 1, "unroll": false, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "units": 128, "dropout": 0.0, "return_state": false, "dtype": "float32", "go_backwards": false, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "recurrent_dropout": 0.0, "unit_forget_bias": true, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "recurrent_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "batch_input_shape": [null, 12, 1], "name": "lstm_1"}}, {"class_name": "Dropout", "config": {"rate": 0.2, "seed": null, "trainable": true, "name": "dropout_1", "noise_shape": null}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "stateful": false, "trainable": true, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "implementation": 1, "unroll": false, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dropout": 0.0, "return_state": false, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "recurrent_dropout": 0.0, "unit_forget_bias": true, "activation": "tanh", "recurrent_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "units": 50, "name": "lstm_2"}}, {"class_name": "Dropout", "config": {"rate": 0.2, "seed": null, "trainable": true, "name": "dropout_2", "noise_shape": null}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "stateful": false, "trainable": true, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "implementation": 1, "unroll": false, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dropout": 0.0, "return_state": false, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "recurrent_dropout": 0.0, "unit_forget_bias": true, "activation": "tanh", "recurrent_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "units": 50, "name": "lstm_3"}}, {"class_name": "Dropout", "config": {"rate": 0.2, "seed": null, "trainable": true, "name": "dropout_3", "noise_shape": null}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "stateful": false, "trainable": true, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "implementation": 1, "unroll": false, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dropout": 0.0, "return_state": false, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "recurrent_dropout": 0.0, "unit_forget_bias": true, "activation": "tanh", "recurrent_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "units": 50, "name": "lstm_4"}}, {"class_name": "Dropout", "config": {"rate": 0.2, "seed": null, "trainable": true, "name": "dropout_4", "noise_shape": null}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "stateful": false, "trainable": true, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "implementation": 1, "unroll": false, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dropout": 0.0, "return_state": false, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "recurrent_dropout": 0.0, "unit_forget_bias": true, "activation": "tanh", "recurrent_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "units": 50, "name": "lstm_5"}}, {"class_name": "Dropout", "config": {"rate": 0.2, "seed": null, "trainable": true, "name": "dropout_5", "noise_shape": null}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "stateful": false, "trainable": true, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "implementation": 1, "unroll": false, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dropout": 0.0, "return_state": false, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "recurrent_dropout": 0.0, "unit_forget_bias": true, "activation": "tanh", "recurrent_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "units": 50, "name": "lstm_6"}}, {"class_name": "Dropout", "config": {"rate": 0.2, "seed": null, "trainable": true, "name": "dropout_6", "noise_shape": null}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "stateful": false, "trainable": true, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "implementation": 1, "unroll": false, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dropout": 0.0, "return_state": false, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "recurrent_dropout": 0.0, "unit_forget_bias": true, "activation": "tanh", "recurrent_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "units": 50, "name": "lstm_7"}}, {"class_name": "Dropout", "config": {"rate": 0.2, "seed": null, "trainable": true, "name": "dropout_7", "noise_shape": null}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "stateful": false, "trainable": true, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "implementation": 1, "unroll": false, "return_sequences": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dropout": 0.0, "return_state": false, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "recurrent_dropout": 0.0, "unit_forget_bias": true, "activation": "tanh", "recurrent_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "units": 50, "name": "lstm_8"}}, {"class_name": "Dropout", "config": {"rate": 0.2, "seed": null, "trainable": true, "name": "dropout_8", "noise_shape": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "units": 1, "trainable": true, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "dense_1", "kernel_constraint": null, "bias_constraint": null}}], "name": "sequential_1"}}